In [2]:
import pandas as pd
import seaborn as sns
df = pd.read_csv(r"C:\Users\srika\OneDrive\Documents\York\Sem-1 york\MBAN 6110 - Data Science 1\new_data.csv\new_data.csv",index_col='Unnamed: 0')
print(df.columns)

Index(['event_time', 'event_type', 'product_id', 'category_id',
       'category_code', 'brand', 'price', 'user_id', 'user_session'],
      dtype='object')

In [3]:
df.head()

,event_time,event_type,product_id,category_id,category_code,brand,price,user_id,user_session
0,2019-11-01 00:00:00 UTC,view,1003461,2053013555631882655,electronics.smartphone,xiaomi,489.07,520088904,4d3b30da-a5e4-49df-b1a8-ba5943f1dd33
1,2019-11-01 00:00:00 UTC,view,5000088,2053013566100866035,appliances.sewing_machine,janome,293.65,530496790,8e5f4f83-366c-4f70-860e-ca7417414283
2,2019-11-01 00:00:01 UTC,view,17302664,2053013553853497655,NaN,creed,28.31,561587266,755422e7-9040-477b-9bd2-6a6e8fd97387
3,2019-11-01 00:00:01 UTC,view,3601530,2053013563810775923,appliances.kitchen.washer,lg,712.87,518085591,3bfb58cd-7892-48cc-8020-2f17e6de6e7f
4,2019-11-01 00:00:01 UTC,view,1004775,2053013555631882655,electronics.smartphone,xiaomi,183.27,558856683,313628f1-68b8-460d-84f6-cec7a8796ef2

In [4]:
print(df.shape)
df.describe(include='all')

(10000000, 9)

,event_time,event_type,product_id,category_id,category_code,brand,price,user_id,user_session
count,10000000,10000000,1.000000e+07,1.000000e+07,6697210,8589537,1.000000e+07,1.000000e+07,10000000
unique,523423,3,NaN,NaN,126,3373,NaN,NaN,2190461
top,2019-11-05 17:23:19 UTC,view,NaN,NaN,electronics.smartphone,samsung,NaN,NaN,4488e77a-9901-4c4b-b162-47a224ceab51
freq,113,9731128,NaN,NaN,2543371,1158050,NaN,NaN,504
mean,NaN,NaN,1.100008e+07,2.057828e+18,NaN,NaN,2.925741e+02,5.354292e+08,NaN
std,NaN,NaN,1.228346e+07,1.943274e+16,NaN,NaN,3.538111e+02,2.037214e+07,NaN
min,NaN,NaN,1.000365e+06,2.053014e+18,NaN,NaN,0.000000e+00,1.030022e+07,NaN
25%,NaN,NaN,1.005252e+06,2.053014e+18,NaN,NaN,6.667000e+01,5.159950e+08,NaN
50%,NaN,NaN,5.100722e+06,2.053014e+18,NaN,NaN,1.653100e+02,5.306267e+08,NaN
75%,NaN,NaN,1.640001e+07,2.053014e+18,NaN,NaN,3.654600e+02,5.548916e+08,NaN
max,NaN,NaN,6.210003e+07,2.180737e+18,NaN,NaN,2.574070e+03,5.684226e+08,NaN

In [5]:
df.isnull().sum()

event_time             0
event_type             0
product_id             0
category_id            0
category_code    3302790
brand            1410463
price                  0
user_id                0
user_session           0
dtype: int64

In [6]:
# we need to match catigory ID with catigory code
df[df['category_code'].isnull()].fillna(df['category_code'],inplace=True,)

In [20]:
df.isnull().sum()

event_time             0
event_type             0
product_id             0
category_id            0
category_code    3302790
brand            1410463
price                  0
user_id                0
user_session           0
dtype: int64

In [24]:
dfs=df[['category_code','category_id']]
dfs=dfs.drop_duplicates()
dfs.dropna(inplace=True)
print(dfs.shape)
dfs.head()
dfd=df[['category_code','product_id']]
dfd=dfd.drop_duplicates()
dfd.dropna(inplace=True)
print(dfd.shape)
dfd.head()

(252, 2)
(60956, 2)

               category_code  product_id
0     electronics.smartphone     1003461
1  appliances.sewing_machine     5000088
3  appliances.kitchen.washer     3601530
4     electronics.smartphone     1004775
5         computers.notebook     1306894

In [25]:
df.fillna(dfs, inplace=True)
df.fillna(dfd, inplace=True)
df.isnull().sum()

event_time             0
event_type             0
product_id             0
category_id            0
category_code    3302790
brand            1410463
price                  0
user_id                0
user_session           0
dtype: int64

AttributeError: 'numpy.int64' object has no attribute 'unstack'